docs/user.wsdl

<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ithillel.ua/soap" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ithillel.ua/soap" name="UserSOAPService">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://ithillel.ua/soap" schemaLocation="http://localhost:8080/hillel-soap-demo/ws/user?xsd=1"/>
        </xsd:schema>
    </types>
    <message name="addUser">
        <part name="user" type="tns:user"/>
    </message>
    <message name="addUserResponse">
        <part name="return" type="xsd:string"/>
    </message>
    <message name="getUsers"/>
    <message name="getUsersResponse">
        <part name="return" type="tns:userList"/>
    </message>
    <portType name="UserSOAP">
        <operation name="addUser">
            <input wsam:Action="http://ithillel.ua/soap/UserSOAP/addUserRequest" message="tns:addUser"/>
            <output wsam:Action="http://ithillel.ua/soap/UserSOAP/addUserResponse" message="tns:addUserResponse"/>
        </operation>
        <operation name="getUsers">
            <input wsam:Action="http://ithillel.ua/soap/UserSOAP/getUsersRequest" message="tns:getUsers"/>
            <output wsam:Action="http://ithillel.ua/soap/UserSOAP/getUsersResponse" message="tns:getUsersResponse"/>
        </operation>
    </portType>
    <binding name="UserSOAPPortBinding" type="tns:UserSOAP">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"/>
        <operation name="addUser">
            <soap:operation soapAction=""/>
            <input>
                <soap:body use="literal" namespace="http://ithillel.ua/soap"/>
            </input>
            <output>
                <soap:body use="literal" namespace="http://ithillel.ua/soap"/>
            </output>
        </operation>
        <operation name="getUsers">
            <soap:operation soapAction=""/>
            <input>
                <soap:body use="literal" namespace="http://ithillel.ua/soap"/>
            </input>
            <output>
                <soap:body use="literal" namespace="http://ithillel.ua/soap"/>
            </output>
        </operation>
    </binding>
    <service name="UserSOAPService">
        <port name="UserSOAPPort" binding="tns:UserSOAPPortBinding">
            <soap:address location="http://localhost:8080/hillel-soap-demo/ws/user"/>
        </port>
    </service>
</definitions>